<html>
<head>
    <title>Anyelo Gustavo Hern&aacute;ndez Ayala | 201807398</title>
</head>
<body bgcolor="#fdf5df">
<hr>
    <h1>Nombre: Anyelo Gustavo Her&aacute;ndez Ayala</h1>
    <h1>Carnet: 201807398</h1>
    <table border="1">
        <tr>
            <th>Curso</th>
            <th>Descripci&oacute;n</th>
            <th>Semestre</th>
        </tr>
        <tr>
            <td>Introducci&oacute;n a la programaci&oacute;n</td>
            <td align="justify">El curso busca ser el acercamiento inicial del estudiante de la carrera de sistemas, al mundo de
                Desarrollo de Software mediante el uso de m&eacute;todos, t&eacute;cnicas y metodolog&iacute;as especializadas. Se
                fundamenta en el concepto de algoritmo para la resoluci&oacute;n de problemas de programaci&oacute;n utilizando
                computadoras, enfatizando el uso del paradigma de Programaci&oacute;n Orientado a Objetos. Se acerca al
                estudiante al conocimiento de los principales algoritmos de b&uacute;squedas y ordenamientos. Asimismo,
                el estudiante conocer&aacute; el lenguaje Java como el lenguaje oficial de programaci&oacute;n del curso.</td>
            <td>3</td>
        </tr>
        <tr>
            <td>Matem&aacute;tica Intermedia 2</td>
            <td align="justify">Matem&aacute;tica en la cual se estudian funciones vectoriales y curvas en el espacio mediante la resoluci&oacute;n de
                problemas con derivadas parciales, gradientes diferencial total y valores extremos. Tambi&eacute;n se definen y operan
                integrales m&uacute;ltiples, de l&iacute;nea y de superficie.</td>
            <td>4</td>
        </tr>
        <tr>
            <td>Matem&aacute;tica Intermedia 3</td>
            <td align="justify">El curso busca reconocer los conceptos en sus distintas representaciones, procedimientos y m&eacute;todos matem&aacute;ticos
                para la correcta formulaci&oacute;n, an&aacute;lisis y resoluci&oacute;n de problemas involucrados en ingenier&iacute;a y ciencias afines,
                por medio de modelos matem&aacute;ticos adecuados. Se estudian temas como ecuaciones diferenciales y sus aplicaciones.</td>
            <td>4</td>
        </tr>
        <tr>
            <td>Matem&aacute;tica para Computaci&oacute;n</td>
            <td align="justify">Este curso trata que el estudiante reconozca, formule, manipule y aplique los conceptos, definiciones, teoremas, procedimientos y
                t&eacute;cnicas de la matem&aacute;tica discreta como una base que le permitir&aacute; desarrollar una comprensi&oacute;n significativa
                de la tecnolog&iacute;a de informaci&oacute;n y comunicaci&oacute;n; en particular, en las &aacute;reas de combinatoria, l&oacute;gica,
                conjuntos y especialmente, el &aacute;lgebra de Boole.</td>
                <td>3</td>
        </tr>
        <tr>
            <td>L&oacute;gica de Sistemas</td>
            <td align="justify">Este curso forma parte del &aacute;rea Metodolog&iacute;a de Sistemas, en el pensum de estudios de la carrera de Ingenier&iacute;a en
                Ciencias y Sistemas. Su intenci&oacute;n es introducir al estudiante en la comprensi&oacute;n del «pensamiento» analizando este
                como sub-sistema b&aacute;sico del sistema humano. El estudio del ser humano desde esta perspectiva nos permitir&aacute;
                comprender c&oacute;mo se forman los pensamientos en nuestra mente, c&oacute;mo llegamos a los denominados modelos mentales,
                c&oacute;mo estos influyen y determinan nuestro comportamiento.</td>
            <td>3</td>
        </tr>
    </table>
<hr>
</body>
</html>
